[
    {
        "story": "You are looking for a bike. You’ve just moved to a new part of town. Your commute is about 15 miles each way, with long, steady inclines and one short, steep climb near the end. You’d like to stop worrying about daily charging — you ride five days a week and often run errands afterward. On weekends you take the same bike onto gravel greenways and sandy trails that get soft and slushy once winter hits. You want something that keeps a steady, natural pace on flats and gives smooth support into headwinds or up grades, without the jerky feel of older on/off assist systems. Braking should stay strong and predictable even when it’s wet. You often finish rides at dusk on unlit paths, so bright built-in lights that help you stay visible and move around the bike are a real plus. Comfort matters on longer rides, but you don’t need a downhill tank — just a capable, dependable bike that handles both your weekday commute and your weekend detours.",
        "img_path": "https://m.media-amazon.com/images/I/71zp0Nh1PWL._AC_SL1500_.jpg",
        "target": {
            "title": "HOVSCO Electric Bike for Adults, 750W Motor Torque Sensor 48V 20Ah LG Battery Ebike, 28Mph 80Mile Range Electric Mountain Bike, 26\"x4\" Fat Tire Adult Electric Bicycle, Shimano 7 Speed UL Certified",
            "asin": "B0C1GQT7JT",
            "content": "title: HOVSCO Electric Bike for Adults, 750W Motor Torque Sensor 48V 20Ah LG Battery Ebike, 28Mph 80Mile Range Electric Mountain Bike, 26\"x4\" Fat Tire Adult Electric Bicycle, Shimano 7 Speed UL Certified features: ▶【Most Advanced 85N.m Torque Sensor】--The torque sensor pedal assist systems measure the force that the rider applies on the ebikes pedals. It samples pedaling almost in real time and adjusts output power optimally to achieve a highly satisfying riding experience.Promises a great uphill ability to climb up a 40° slop with ease. ▶【Powerful Brushless Gear Hub Motor】--750W peak 1032W Bafang SUTTO motor makes the electric bike easier to climb and start quickly. The ebikes for adults have top speeds reaching up to 28 MPH. Please reach out the customer service to unlock the higher speed limit. ▶【Large Capacity LG Battery & LED Strip Light】--With a removable 48V 20Ah LG cells Lithium-Ion battery, our electric bicycle support goes up to 60-80 miles in pedal-assist mode with per full charge. The HovAlpha battery is also equipped with a full LED strip light on one side, which includes 120 pcs LED beads and provides a 4-meter-long, 20-square-meter bright light for you while taking out the battery and turning it on at night. There are 3 lighting modes to choose. ▶【Safety Suspension Fork & 180mm Rotors Hydraulic Disc Brakes】-- The front hydraulic suspension fork is smoother and more comfortable helping you pass rough terrain with less effort when riding on bumpy roads. Hydraulic disc brakes have better modulation and stopping power than mechanical disc brakes. Riders can ride the fat tire electric bike with confidence in any venue. ▶【App Control & Intelligent LCD Display】---Customers can download our App on the Apple store and Android app stores at any time. It's super handy to see your speed, traveling time, trip, and odometer.LCD display monitors are easy to read in direct sunlight when riding, and monitor the data in real-time (speed, battery, travel mileage, and level of PAS ), the easy control panel enables you to change the 3 working modes while riding the electric bike. details: Brand: HOVSCO Color: Champagne Material: Aluminum Bike Type: Electric Bike, City Bike,Commuting bike, Urban Bike,Cruiser Bike Item Package Dimensions L x W x H: 66.5 x 33.8 x 11.2 inches Item Weight: 74 Pounds Brand Name: HOVSCO Model Name: HovAlpha Suggested Users: Unisex-adult Manufacturer: SHENZHEN UNI-SUN ELECTRONICS CO., LTD. Part Number: F621 Best Sellers Rank: {'Sports & Outdoors': 155675, 'Adult Electric Bicycles': 368} Date First Available: October 17, 2022 Size: Large Age Range (Description): Adult Included Components: Electric Bike, Manual, Charger, E Bike Special Feature: Digital Display Frame Material: Aluminum Number of Speeds: 7 Wheel Size: 26 Inches Suspension Type: Front Brake Style: Disc",
            "price": 1799.0,
            "rating": 4.6,
            "categories": [
                "Sports & Outdoors",
                "Sports",
                "Cycling",
                "Bikes",
                "Electric Bicycles"
            ]
        },
        "domain": "Bicycle"
    },
    {
        "story": "You’re looking for a fast road bike for long rides on smooth pavement. Your routes have steady tempo sections, short climbs, and quick descents. You want a bike that feels light when you pick it up and stiff when you push on the pedals. The front end should stay solid when you stand and sprint or lean into a corner. Cables should run inside the frame so nothing rattles or snags. Shifting needs to be quick and reliable so you can hold cadence and change gears without thinking. You prefer a wheelset that feels lively when you get up to pace. Brakes should be predictable so you can carry speed and still stop with confidence. You’re fine with a little assembly at home as long as it’s straightforward. You’d also like to try the local amateur race they run every year.",
        "img_path": "https://m.media-amazon.com/images/I/71zp0Nh1PWL._AC_SL1500_.jpg",
        "target": {
            "title": "SAVADECK Phantom 2.0 Carbon Fiber Road Bike 700C Carbon Frame Racing Bicycle with Shimano Ultegra 8000 22 Speed Group Set, 25C Tire and Fizik Saddle.",
            "asin": "B0C2D2QLXD",
            "content": "title: SAVADECK Phantom 2.0 Carbon Fiber Road Bike 700C Carbon Frame Racing Bicycle with Shimano Ultegra 8000 22 Speed Group Set, 25C Tire and Fizik Saddle. features: 【Carbon Fiber Material】:Road Bike with T800 carbon fiber frame,carbon front fork and carbon seat tube. Weight only 8.3kg (18.3 lb). Under the same volume, the hardness of the material is 5 times higher than that of the aluminum alloy bicycle frame.Lightweight design for this adult bike is suitable for men and women. 【Shimano Ultegra R8000 Groupsets】- SHIMANO Ultegra 8000 2*11 Speeds with Shifter lever, Front derailleur, Rear derailleur, V Brake, Crankset and Freewheel - It enables you to start and operate your ride effectively, smooth shifting and durable.The best choice for racer cyclists. 【Wind-breaking design】Designed in the Wind Tunnel, the stays, seat post, and seat tube are aerodynamically contoured; fully internal cable routing ensures clean airflow over the entire bike; The tapered head tube strengthens the torsion rigidity and give riders a better handling. 【Ultralight Carbon Fiber Wheelset】SAVADECK Road Bike 700*25C Carbon Wheelset makes climbing hills, stable downhills and chasing the ultimate race bike easy. Lightweight, high-strength carbon fiber tires are designed to absorb road noise and cushion bumps, while enhancing comfort design features for high-speed cruising. SAVADECK road bikes will be ideal for your longest roads. 【Inner Cable Routing Bike Frame】:Simple and beautiful inner cable routing prevents rain and sun damage, reduces the probability of rusting of brake cables and shifting cables, and increases durability; it can also avoid scratching the cable tube when riding, making riding safer; 【Ready To Go】90% pre-assembled complete carbon fiber road bike perfect for beginners, enthusiasts, and intermediate riders, your best choice for any situation. If you need help or information, please feel free to contact us. details: Brand: SAVADECK Color: Black Age Range (Description): Adult Size: 50cm Special Feature: Lightweight Model Name: R09-R8000-22S Brand Name: SAVADECK Manufacturer: SAVADECK Part Number: R09-R8000-22S Included Components: Bell, Lock Best Sellers Rank: {'Sports & Outdoors': 563583, 'Road Bikes': 99} Date First Available: April 12, 2023 Frame Material: Aluminum, Carbon Fiber Bike Type: Road Bike Number of Speeds: 22 Suspension Type: Rear, Front Brake Style: Linear Pull",
            "price": 2199.0,
            "rating": 4.5,
            "categories": [
                "Sports & Outdoors",
                "Sports",
                "Cycling",
                "Bikes",
                "Electric Bicycles"
            ]
        },
        "domain": "Bicycle"
    },
    {
        "story": "You’re looking for a bike to bring on camping trips and weekend road drives. It should fold down quickly to fit beside coolers and tents in the trunk, stay latched shut when folded, and pop open without fuss when you reach the campground. Around camp you’ll ride paved loops, hard-packed paths, and short runs into town, so you want light, simple handling with gears that make rolling hills easy. Braking should feel steady on pavement and dirt, not grabby, and the bike should feel solid on its small wheels with sturdy rims that don’t mind curbs or rough patches. A basic kickstand is useful around the site, and you prefer straightforward parts you can adjust yourself. The folded package should be compact enough to stash in a cabin corner or tent vestibule, and you don’t want to haul something heavy—just a lightweight folder that’s easy to lift in and out of the car. Quick fold-up, quick-release touches, and pedals that tuck away so they don’t snag on bags are all pluses. The goal is a compact, reliable folding bike you can load, unfold, ride around camp and into town, then fold and pack again without drama.",
        "img_path": "https://m.media-amazon.com/images/I/41XzalrXaoS._AC_.jpg",
        "target": {
            "title": "ZiZZO Urbano 24lb Lightest Aluminum Frame Genuine Shimano 8-Speed 20-Inch Folding Bike",
            "asin": "B09GCMQYH7",
            "content": "title: ZiZZO Urbano 24lb Lightest Aluminum Frame Genuine Shimano 8-Speed 20-Inch Folding Bike features: All Super Light Weight Aluminum Alloy - Frame, Fork, Handle bar, Stem, Seat post, Kick stand, Head set, Front & rear hub, Crank set, Chain, V-style brakes and more. Genuine Shimano Altus 8-speed Derailleur, Shimano Revo 8-Speed Grip Style Shifter and Shimano11-32T 8-Speed Cassette Gears. Adjustable stem adapts to riders of all sizes from under five feet to over six feet four Double Wall Rims, ultra-light multi-terrain tires, high strength resin folding pedal and Magnet Catcher to hole folded bike together. Folded size: H-27\" L-31\" W-12.5. Weight: 24.5 lbs (lightest folding bike): Maximum weight capacity: 240 lbs. Recommended for riders 16-75 years of age details: Brand: ZiZZO Color: Red Age Range (Description): Adult Size: 20\" Special Feature: Foldable Model Name: ZiZZO Urbano 8-speed Folding Bike Style: Bike Item Package Dimensions L x W x H: 34 x 28 x 13.6 inches Package Weight: 19.05 Kilograms Brand Name: ZiZZO Warranty Description: Limited Lifetime frame warranty, 1 year component warranty Material: Aluminum Suggested Users: Unisex-adult Manufacturer: ZIZZO Part Number: 16021A Included Components: Kickstand, Adjustable handlebar stem height, Magnetic frame catch, Adjustable seat post height, Folding pedalsKickstand, Adjustable handlebar stem height, Magnetic frame catch, Adjustable seat post height, Folding pedals  See more Best Sellers Rank: {'Sports & Outdoors': 104324, 'Adult Folding Bikes': 12} Date First Available: June 16, 2021 Item Weight: 24 Pounds Frame Material: Aluminum Wheel Size: 20 Inches Bike Type: Folding Bike Number of Speeds: 8 Suspension Type: Rigid Brake Style: Linear Pull",
            "price": 429.99,
            "rating": 4.5,
            "categories": [
                "Sports & Outdoors",
                "Sports",
                "Cycling",
                "Bikes",
                "Electric Bicycles"
            ]
        },
        "domain": "Bicycle"
    }
]