[
    {
        "story": "You've recently moved to a new city and your daily commute is about 15 miles each way. You're also looking forward to weekend adventures exploring trails and parks around the area. You want something reliable that can handle both city streets and occasional off-road paths, while being comfortable for longer rides.",
        "img_path": "https://m.media-amazon.com/images/I/71zp0Nh1PWL._AC_SL1500_.jpg",
        "target": {
            "title": "HOVSCO Electric Bike for Adults, 750W Motor Torque Sensor 48V 20Ah LG Battery Ebike, 28Mph 80Mile Range Electric Mountain Bike, 26\"x4\" Fat Tire Adult Electric Bicycle, Shimano 7 Speed UL Certified",
            "asin": "B0C1GQT7JT",
            "content": "title: HOVSCO Electric Bike for Adults, 750W Motor Torque Sensor 48V 20Ah LG Battery Ebike, 28Mph 80Mile Range Electric Mountain Bike, 26\"x4\" Fat Tire Adult Electric Bicycle, Shimano 7 Speed UL Certified features: ▶【Most Advanced 85N.m Torque Sensor】--The torque sensor pedal assist systems measure the force that the rider applies on the ebikes pedals. It samples pedaling almost in real time and adjusts output power optimally to achieve a highly satisfying riding experience.Promises a great uphill ability to climb up a 40° slop with ease. ▶【Powerful Brushless Gear Hub Motor】--750W peak 1032W Bafang SUTTO motor makes the electric bike easier to climb and start quickly. The ebikes for adults have top speeds reaching up to 28 MPH. Please reach out the customer service to unlock the higher speed limit. ▶【Large Capacity LG Battery & LED Strip Light】--With a removable 48V 20Ah LG cells Lithium-Ion battery, our electric bicycle support goes up to 60-80 miles in pedal-assist mode with per full charge. The HovAlpha battery is also equipped with a full LED strip light on one side, which includes 120 pcs LED beads and provides a 4-meter-long, 20-square-meter bright light for you while taking out the battery and turning it on at night. There are 3 lighting modes to choose. ▶【Safety Suspension Fork & 180mm Rotors Hydraulic Disc Brakes】-- The front hydraulic suspension fork is smoother and more comfortable helping you pass rough terrain with less effort when riding on bumpy roads. Hydraulic disc brakes have better modulation and stopping power than mechanical disc brakes. Riders can ride the fat tire electric bike with confidence in any venue. ▶【App Control & Intelligent LCD Display】---Customers can download our App on the Apple store and Android app stores at any time. It's super handy to see your speed, traveling time, trip, and odometer.LCD display monitors are easy to read in direct sunlight when riding, and monitor the data in real-time (speed, battery, travel mileage, and level of PAS ), the easy control panel enables you to change the 3 working modes while riding the electric bike. details: Brand: HOVSCO Color: Champagne Material: Aluminum Bike Type: Electric Bike, City Bike,Commuting bike, Urban Bike,Cruiser Bike Item Package Dimensions L x W x H: 66.5 x 33.8 x 11.2 inches Item Weight: 74 Pounds Brand Name: HOVSCO Model Name: HovAlpha Suggested Users: Unisex-adult Manufacturer: SHENZHEN UNI-SUN ELECTRONICS CO., LTD. Part Number: F621 Best Sellers Rank: {'Sports & Outdoors': 155675, 'Adult Electric Bicycles': 368} Date First Available: October 17, 2022 Size: Large Age Range (Description): Adult Included Components: Electric Bike, Manual, Charger, E Bike Special Feature: Digital Display Frame Material: Aluminum Number of Speeds: 7 Wheel Size: 26 Inches Suspension Type: Front Brake Style: Disc",
            "price": 1799.0,
            "rating": 4.6,
            "categories": [
                "Sports & Outdoors",
                "Sports",
                "Cycling",
                "Bikes",
                "Electric Bicycles"
            ]
        },
        "domain": "Bicycle"
    }
]