[
    {
        "story": "You are looking for a digital camera. You've joined a local wildlife conservation group and volunteered to document bird species at a nearby nature reserve. The birds are often far away and don't stay still for long. You'll be photographing them in flight and perched in trees in varying light conditions. You'll be on uneven trails where you can't always use a tripod, and you need to be ready to shoot quickly. After your outings, you'll review your images and sometimes want to enlarge or crop them to highlight specific details you captured.",
        "img_path": "https://m.media-amazon.com/images/I/91G0RmpalXL._AC_SL1500_.jpg",
        "target": {
            "title": "Samsung WB2200F 16.3MP CMOS Smart WiFi & NFC Digital Camera with 60x Optical Zoom, 3.0in LCD and 1080p HD Video (Black) (Renewed)",
            "asin": "B07FMYZNWS",
            "content": "title: Samsung WB2200F 16.3MP CMOS Smart WiFi & NFC Digital Camera with 60x Optical Zoom, 3.0in LCD and 1080p HD Video (Black) (Renewed)  features: This Certified Refurbished product is tested and certified to look and work like new. The refurbishing process includes functionality testing, basic cleaning, inspection, and repackaging. The product ships with all relevant accessories, a minimum 90-day warranty, and may arrive in a generic box. Only select sellers who maintain a high performance bar may offer Certified Refurbished products on Amazon.com Share your best photos instantly with Family and Friends with Built-in Wi-Fi with NFC SMART features - Social Media Upload, E-mail, Photo beam, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All Share Extended Battery Life - allows over 500 shots per charge 60x Optical Zoom for stunning long distance shots with ease  description: Share your best photos instantly with Family and Friends with Built-in Wi-Fi with NFC SMART features - Social Media Upload, E-mail, Photo beam, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All Share Extended Battery Life - allows over 500 shots per charge 60x Optical Zoom for stunning long distance shots with ease 3.0 HVGA LCD with EVF  details: Product Dimensions: 4.69 x 4.13 x 4.8 inches Item Weight: 1.56 pounds Item model number: EC-WB2200BPBUS-cr Batteries: 1 Lithium Metal batteries required. Is Discontinued By Manufacturer: No Date First Available: July 17, 2018 Manufacturer: Samsung Brand: SAMSUNG Model Name: WB2200F Maximum Webcam Image Resolution: 16.3 MP Photo Sensor Size: 1/2.3-inch Image Stabilization: Optical, Digital Max Shutter Speed: 1/2000 seconds Min Shutter Speed: 8 seconds Metering Description: Multi, Center-weighted, Spot Exposure Control Type: Program, A/S/M, Smart, Automatic Form Factor: Compact",
            "price": null,
            "rating": 4.0,
            "categories": [
                "Electronics",
                "Camera & Photo",
                "Digital Cameras",
                "DSLR Cameras"
            ]
        },
        "domain": "digital_camera"
    }
]