[
    {
        "story": "You are looking for a digital camera. You’re helping at a coastal bird sanctuary where sightings can happen either right by the boardwalk or way out across the lagoon. You travel light and don’t want to juggle or swap lenses when a heron lifts off or a wren pops into view. Most of your shooting is handheld, and you frequently frame tall subjects on reeds or tree trunks, so it needs to feel just as steady and comfortable when you’re holding it upright as when you’re shooting horizontally. You often jump from wide habitat context to tight detail on a distant subject in seconds, and setting up a tripod isn’t realistic with wind and passing foot traffic. At the end of each session you like to beam a few clips and photos straight to your phone at the visitors’ center to show the education team that same day. You don’t care about cinematic bells and whistles; clean, dependable footage and reliable reach matter most, along with an all-day carry you can keep ready in your hands rather than in a bag.",
        "img_path": "https://m.media-amazon.com/images/I/91G0RmpalXL._AC_SL1500_.jpg",
        "target": {
            "title": "Samsung WB2200F 16.3MP CMOS Smart WiFi & NFC Digital Camera with 60x Optical Zoom, 3.0in LCD and 1080p HD Video (Black) (Renewed)",
            "asin": "B07FMYZNWS",
            "content": "title: Samsung WB2200F 16.3MP CMOS Smart WiFi & NFC Digital Camera with 60x Optical Zoom, 3.0in LCD and 1080p HD Video (Black) (Renewed)  features: This Certified Refurbished product is tested and certified to look and work like new. The refurbishing process includes functionality testing, basic cleaning, inspection, and repackaging. The product ships with all relevant accessories, a minimum 90-day warranty, and may arrive in a generic box. Only select sellers who maintain a high performance bar may offer Certified Refurbished products on Amazon.com Share your best photos instantly with Family and Friends with Built-in Wi-Fi with NFC SMART features - Social Media Upload, E-mail, Photo beam, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All Share Extended Battery Life - allows over 500 shots per charge 60x Optical Zoom for stunning long distance shots with ease  description: Share your best photos instantly with Family and Friends with Built-in Wi-Fi with NFC SMART features - Social Media Upload, E-mail, Photo beam, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All Share Extended Battery Life - allows over 500 shots per charge 60x Optical Zoom for stunning long distance shots with ease 3.0 HVGA LCD with EVF  details: Product Dimensions: 4.69 x 4.13 x 4.8 inches Item Weight: 1.56 pounds Item model number: EC-WB2200BPBUS-cr Batteries: 1 Lithium Metal batteries required. Is Discontinued By Manufacturer: No Date First Available: July 17, 2018 Manufacturer: Samsung Brand: SAMSUNG Model Name: WB2200F Maximum Webcam Image Resolution: 16.3 MP Photo Sensor Size: 1/2.3-inch Image Stabilization: Optical, Digital Max Shutter Speed: 1/2000 seconds Min Shutter Speed: 8 seconds Metering Description: Multi, Center-weighted, Spot Exposure Control Type: Program, A/S/M, Smart, Automatic Form Factor: Compact",
            "price": null,
            "rating": 4.0,
            "categories": [
                "Electronics",
                "Camera & Photo",
                "Digital Cameras",
                "DSLR Cameras"
            ]
        },
        "domain": "digital_camera"
    },
    {
        "story": "You love traveling and are looking for a digital camera to take on trips. You pack light and walk a lot, so it should be small and easy to carry all day. Most of your photos are quick: family, street scenes, and little details you spot along the way. You like using a small prime lens and don’t plan to switch lenses during the day. The camera should start fast and focus quickly. You want to shoot from the rear screen when you hold the camera low or high, and you also want a viewfinder for bright sun. Faces in group shots should come out sharp. Indoors, you want shadows to keep some detail instead of turning into solid black. The menus should be clear, the screen easy to see outside, and the controls simple to learn. You’d like flexible storage so you’re not stuck if one card fills up. You’re fine doing a little setup at home.",
        "img_path": "https://m.media-amazon.com/images/I/51mJY-XX8oL._AC_.jpg",
        "target": {
            "title": "Olympus Evolt E420 10MP Digital SLR Camera with 25mm f/2.8 Pancake Zuiko Lens",
            "asin": "B0015DCVYY",
            "content": "title: Olympus Evolt E420 10MP Digital SLR Camera with 25mm f/2.8 Pancake Zuiko Lens  features: 10-megapixel CMOS sensor captures enough detail for photo-quality 18 x 24-inch prints 2.7-inch Live View HyperCrystal II LCD screen TruePic III for superior image quality in all lighting situations; exclusive dust-free technology for spot-free photos Lightweight ergonomic design; kit includes 25mm f/2.8 Pancake Zuiko lens Stores images on CF, Micro Drive, or xD Picture Cards (not included)  description: From the Manufacturer The lightweight, 10-megapixel Olympus E420 DSLR offers heavyweight technologies, including a bigger, more viewable 2.7-inch LCD and consumer-friendly fast On-Screen Autofocus, Face Detection, Shadow Adjustment Technology and Perfect Shot Preview to get the most out of the Live View experience. Additionally, when it comes to Live View, not all LCDs are created equal. At 2.7 inches, the portable E-420 LCD is large enough for users to compose and review images without squinting. The small cameras LCD is not just larger, it is part of a camera with technologies intelligent enough to take advantage of the Live View photography experience. These innovative technologies include: On-Screen Autofocus works as seamlessly as a point-and-shoot to display subjects in focus on the LCD the instant the shutter is pressed half way. On-Screen Autofocus works as seamlessly as a point-and-shoot to display subjects in focus on the LCD the instant the shutter is pressed half way. Face Detection Technology targets and locks on up to eight faces to ensure they are in focus and crystal clear for amazing portraits. Face Detection Technology targets and locks on up to eight faces to ensure they are in focus and crystal clear for amazing portraits. New and Improved HyperCrystal II Technology delivers twice the contrast and better viewing in extreme lighting conditions, a broader range of color detail, and a wider angle of view on the LCD so you and your friends can see it up to 176 degrees off-center. New and Improved HyperCrystal II Technology delivers twice the contrast and better viewing in extreme lighting conditions, a broader range of color detail, and a wider angle of view on the LCD so you and your friends can see it up to 176 degrees off-center. Shadow Adjustment Technology captures detail in the bright areas of a frame and opens up detail in the shadows that other cameras would render too dark or underexposed. Shadow Adjustment Technology captures detail in the bright areas of a frame and opens up detail in the shadows that other cameras would render too dark or underexposed. Perfect Shot Preview enables you to view and select your favorite effect right on the LCD, and see how the image will look before you even capture it, so you know that what you see is what you get. Evolt E420 Digital SLR Highlights   Worlds smallest digital SLR A camera designed to be held away from the face lets you take great photographs without weighing you down. The E-420 is small enough to fit into a purse or a jacket pocket and light enough to shoot with comfortably all day. Measuring 5.1 inches by 3.6 inches by 2.1 inches (excluding protrusions), it is the worlds smallest digital SLR. And at a featherweight 13.4 ounces, only its predecessor (E-410) weighs less. The E-420s new ergonomic grip on the front of the body allows for easier one-handed operation and ensures a secure hold in the most challenging shooting conditions.   One of the worlds thinnest lenses meets the worlds most compact DSLR The worlds smallest DSLR deserves a similarly compact lens, and Olympus has it: the ultra compact Zuiko 25mm f2.8 digital specific lens. This 0.9 inch-thick lens offers a fixed 50mm equivalent angle of view. Together with the E-420, the Zuiko 25mm f2.8 lens will offer the ultimate combination of ease of use and portability.   The Live View experience Olympus was the first to bring Live View to a consumer DSLR (the E-330 in 2006), and Live View has revolutionized DSLR photography. Anyone who has photographed young children knows that you get the best reactions when you hold the camera away from your face and maintain eye contact and an engaging smile. If you have tried to take photos high above the heads in a crowd or low near the ground, you will appreciate that it is easier to use a swivel LCD screen than to climb a ladder or lie on your stomach.   The E-420 solves these problems with its Live View LCD, which enables photographers to hold the camera away from their faces and at angles they just cannot reach by using the optical viewfinder alone. The E-420s new Live View autofocus functionality now simplifies the process by working just like a point and shoot. By simply pressing the shutter button halfway, your subjects come into focus on the LCD, so when the perfect moment occurs it is easy to capture sharp images.   A viewable LCD is where a great Live View experience begins. Few things are more annoying for a photographer than squinting to see an image on an LCD screen in bright sunlight or a dimly lit room. The E-420 solves this problem with its large, bright 2.7-inch LCD display that incorporates new HyperCrystal II technology. This display offers twice the contrast for better viewing in extreme light conditions (i.e. when the sun is at your back), a broader color gamut that displays a greater range of color detail, and a 176-degree viewing angle.   Always find a face in the crowd A camera this consumer-friendly is perfect for taking portraits of friends and family while out and about. The E-420s Face Detection feature distinguishes between peoples faces and the background. It tracks up to eight faces within the image area and automatically focuses and optimizes exposure for sharp, brilliant portrait pictures. Even if your subjects are moving, the camera continuously tracks their faces.   Bright day or deep shadow, never miss a detail Shooting scenes with shadows can be tricky because of the extreme contrast between dark and bright areas. The E-420 addresses this challenge with Shadow Adjustment Technology that compensates for extreme contrast when shadow areas are underexposed and lack visible detail. Now users can preview and capture images with the same fine contrast they see with their own eyes.   Preview all the possibilities With 18 pre-set scene-select modes for every imaginable shooting scenario and full manual controls, the E-420 offers a world of possibilities to photographers. Additionally, Perfect Shot Preview enables users to preview and select various photographic effects on a live, multi-window screen on the LCD before snapping the shot. This feature shows photographers what their images will look like beforehand under various settings, ensuring that they capture exactly what they want. It is an ideal way for novice users to learn about the effects of different photography techniques, such as exposure compensation, white balance and metering.   Enlarge your photos Capturing, enlarging and displaying amazing images on your wall is a snap thanks to the E-420s 10 million pixels for high-resolution photos. The 10-megapixel sensor gives users the flexibility to enlarge prints to the sizes supported by many of todays printers, or crop the image to print only a part of the image that is important to them. The high-performance Live MOS image sensor in the E-420 delivers excellent dynamic range for accurate color fidelity and a new state-of-the-art amplifier circuit dramatically reduces noise and captures fine image details in the highlight and shadow areas.   Improved auto white balance Many digital SLR users want to focus their attention on things other than white balance while they are on the move. As a result, the E-420 features an improved automatic white balance performance with a new algorithm for more accurate color.   TruePic III for image clarity and speed Olympus TruePic III Image Processor produces crystal-clear photos using all the pixel information for each image to provide the best digital images possible for every photo with accurate color, true-to-life flesh tones, brilliant blue skies and precise tonal representation in between. TruePic III also lowers image noise by one step to reduce graininess in images shot at higher ISO settings, enabling great results in low-light situations.   Worried about missing the winning goal at the soccer game? The image processor on the E-420 enables it to shoot up to 3.5 frames per second in sequenced shooting mode, which means that photographers will be able to capture fast-paced action as it happens.   Dust Reduction System for spot-free images Life moves too fast to spend time worrying about dust ruining your images. Olympus proven Dust Reduction System produces spot-free photos with the exclusive Supersonic Wave Filter. The patented ultrasonic technology vibrates to remove dust and other particles from the front of the image sensor and captures it on a special adhesive membrane every time the camera is turned on. These spot-free photos liberate users from hours spent retouching photographs at the computer or sending their cameras back to the manufacturer to remove dust trapped inside.   Media versatility Accepting both CompactFlash Type I & II, Microdrives, and xD-Picture Cards, the E-420 provides a choice of data storage options for enhanced flexibility, and it is possible to transfer image files from one card to the other right inside the camera.   Wireless flash capability If you decide to venture into the arena of advanced lighting, the E-420 is ready to meet the challenge. The E-420 is compatible with the Olympus FL-50R and FL-36R wireless electronic flashes that are designed exclusively for digital photography. When these flashes are used in combination with the E-420, wireless multi-flash photography is possible. The E-420 can control up to three wireless flash groups independently, with several flash units per group. Perfect Shot Preview enables you to view and select your favorite effect right on the LCD, and see how the image will look before you even capture it, so you know that what you see is what you get. Evolt E420 Digital SLR Highlights Worlds smallest digital SLR A camera designed to be held away from the face lets you take great photographs without weighing you down. The E-420 is small enough to fit into a purse or a jacket pocket and light enough to shoot with comfortably all day. Measuring 5.1 inches by 3.6 inches by 2.1 inches (excluding protrusions), it is the worlds smallest digital SLR. And at a featherweight 13.4 ounces, only its predecessor (E-410) weighs less. The E-420s new ergonomic grip on the front of the body allows for easier one-handed operation and ensures a secure hold in the most challenging shooting conditions. One of the worlds thinnest lenses meets the worlds most compact DSLR The worlds smallest DSLR deserves a similarly compact lens, and Olympus has it: the ultra compact Zuiko 25mm f2.8 digital specific lens. This 0.9 inch-thick lens offers a fixed 50mm equivalent angle of view. Together with the E-420, the Zuiko 25mm f2.8 lens will offer the ultimate combination of ease of use and portability. The Live View experience Olympus was the first to bring Live View to a consumer DSLR (the E-330 in 2006), and Live View has revolutionized DSLR photography. Anyone who has photographed young children knows that you get the best reactions when you hold the camera away from your face and maintain eye contact and an engaging smile. If you have tried to take photos high above the heads in a crowd or low near the ground, you will appreciate that it is easier to use a swivel LCD screen than to climb a ladder or lie on your stomach.   The E-420 solves these problems with its Live View LCD, which enables photographers to hold the camera away from their faces and at angles they just cannot reach by using the optical viewfinder alone. The E-420s new Live View autofocus functionality now simplifies the process by working just like a point and shoot. By simply pressing the shutter button halfway, your subjects come into focus on the LCD, so when the perfect moment occurs it is easy to capture sharp images.   A viewable LCD is where a great Live View experience begins. Few things are more annoying for a photographer than squinting to see an image on an LCD screen in bright sunlight or a dimly lit room. The E-420 solves this problem with its large, bright 2.7-inch LCD display that incorporates new HyperCrystal II technology. This display offers twice the contrast for better viewing in extreme light conditions (i.e. when the sun is at your back), a broader color gamut that displays a greater range of color detail, and a 176-degree viewing angle. Always find a face in the crowd A camera this consumer-friendly is perfect for taking portraits of friends and family while out and about. The E-420s Face Detection feature distinguishes between peoples faces and the background. It tracks up to eight faces within the image area and automatically focuses and optimizes exposure for sharp, brilliant portrait pictures. Even if your subjects are moving, the camera continuously tracks their faces. Bright day or deep shadow, never miss a detail Shooting scenes with shadows can be tricky because of the extreme contrast between dark and bright areas. The E-420 addresses this challenge with Shadow Adjustment Technology that compensates for extreme contrast when shadow areas are underexposed and lack visible detail. Now users can preview and capture images with the same fine contrast they see with their own eyes. Preview all the possibilities With 18 pre-set scene-select modes for every imaginable shooting scenario and full manual controls, the E-420 offers a world of possibilities to photographers. Additionally, Perfect Shot Preview enables users to preview and select various photographic effects on a live, multi-window screen on the LCD before snapping the shot. This feature shows photographers what their images will look like beforehand under various settings, ensuring that they capture exactly what they want. It is an ideal way for novice users to learn about the effects of different photography techniques, such as exposure compensation, white balance and metering. Enlarge your photos Capturing, enlarging and displaying amazing images on your wall is a snap thanks to the E-420s 10 million pixels for high-resolution photos. The 10-megapixel sensor gives users the flexibility to enlarge prints to the sizes supported by many of todays printers, or crop the image to print only a part of the image that is important to them. The high-performance Live MOS image sensor in the E-420 delivers excellent dynamic range for accurate color fidelity and a new state-of-the-art amplifier circuit dramatically reduces noise and captures fine image details in the highlight and shadow areas. Improved auto white balance Many digital SLR users want to focus their attention on things other than white balance while they are on the move. As a result, the E-420 features an improved automatic white balance performance with a new algorithm for more accurate color. TruePic III for image clarity and speed Olympus TruePic III Image Processor produces crystal-clear photos using all the pixel information for each image to provide the best digital images possible for every photo with accurate color, true-to-life flesh tones, brilliant blue skies and precise tonal representation in between. TruePic III also lowers image noise by one step to reduce graininess in images shot at higher ISO settings, enabling great results in low-light situations.   Worried about missing the winning goal at the soccer game? The image processor on the E-420 enables it to shoot up to 3.5 frames per second in sequenced shooting mode, which means that photographers will be able to capture fast-paced action as it happens. Dust Reduction System for spot-free images Life moves too fast to spend time worrying about dust ruining your images. Olympus proven Dust Reduction System produces spot-free photos with the exclusive Supersonic Wave Filter. The patented ultrasonic technology vibrates to remove dust and other particles from the front of the image sensor and captures it on a special adhesive membrane every time the camera is turned on. These spot-free photos liberate users from hours spent retouching photographs at the computer or sending their cameras back to the manufacturer to remove dust trapped inside. Media versatility Accepting both CompactFlash Type I & II, Microdrives, and xD-Picture Cards, the E-420 provides a choice of data storage options for enhanced flexibility, and it is possible to transfer image files from one card to the other right inside the camera. Wireless flash capability If you decide to venture into the arena of advanced lighting, the E-420 is ready to meet the challenge. The E-420 is compatible with the Olympus FL-50R and FL-36R wireless electronic flashes that are designed exclusively for digital photography. When these flashes are used in combination with the E-420, wireless multi-flash photography is possible. The E-420 can control up to three wireless flash groups independently, with several flash units per group. Review from dpreview.com Learn more about this camera at DPReview.com Olympus Evolt E-420 Digital SLR: Highly Recommended (just) by dpreview.com The Olympus E-420 is the most 'junior' member in Olympus line of digital SLRs. It was announced on the 5th March 2008, exactly one year after the launch of its predecessor, the E-410. Like the E-410 it comes with a 10 megapixel resolution, live-view and the SSWF dust reduction system; and like its predecessor at the time it is also the currently lightest and smallest digital SLR on the market, especially if you combine it with the Olympus Zuiko 25mm pancake lens that has been launched at the same time. All in all the E-420 is only a relatively minor update but it does also incorporate a number of new features. New features (compared to the E-410) Larger, 2.7\" LCD display (versus 2.5\" on the E-410) Larger, 2.7\" LCD display (versus 2.5\" on the E-410) Contrast detect autofocus (with select lenses) Contrast detect autofocus (with select lenses) Face detection in live view mode Face detection in live view mode Auto Gradation (Dynamic Range enhancement) Auto Gradation (Dynamic Range enhancement) Faster continuous shooting speeds (3.5 vs 3.0 fps) Faster continuous shooting speeds (3.5 vs 3.0 fps) Improved right hand grip Improved right hand grip Perfect Shot Preview Perfect Shot Preview Wireless flash control • Read more at dpreview.com Wireless flash control • Read more at dpreview.com  details: Auto Focus Technology: Phase Detection, Selective single-point, Multi-area, Continuous, Contrast Detection, Live View Display Resolution Maximum: 230,000 Photo Sensor Size: 1.5 Photo Sensor Technology: CMOS Effective Still Resolution: 10 MP JPEG quality level: Fine Camera Flash: F2.8 Flash Sync Speed: 1/4000_sec Video Capture Resolution: 720p Viewfinder Magnification: 0.92x Viewfinder Type: Optical Screen Size: 2.7 Inches Display Type: LCD Batteries Required?: Yes Number of Batteries: 1 Lithium Ion batteries required. Are Batteries Included: No Rechargeable Battery Included: No Battery Cell Composition: Lithium Ion Battery Description: Lithium Ion Battery Weight: 80 Grams Target Gender: Unisex Connectivity Technology: USB Continuous Shooting Speed: 3.5 Flash Memory Type: Compact Flash (Type I or II), xD Picture Card Special Feature: Lightweight Water Resistance Level: Not Water Resistant Form Factor: Compact SLR Hardware Interface: CompactFlash Type I Aperture Modes: F2.8 Optical Zoom: 1 Maximum Aperture: 2.8 f Minimum Aperture: 2.8 Autofocus Points: 3 Compatible Mountings: Four Thirds Focus Type: Autofocus & Manual Maximum Focal Length: 25 Millimeters Max Shutter Speed: 1/4000 seconds Min Shutter Speed: 60 seconds Exposure Control Type: aperture-priority, Program, bulb, shutter-priority, Manual, Automatic Metering Description: Spot Shooting Modes: landscape-portrait, Landscape, Macro, underwater macro, document, Portrait, fireworks, beach/snow, Panorama, high key, children, sunset, candle, underwater wide, Night Portrait, low key, night scene, nature macro, Sportslandscape-portrait, Landscape, Macro, underwater macro, document, Portrait, fireworks, beach/snow, Panorama, high key, children, sunset, candle, underwater wide, Night Portrait, low key, night scene, nature macro, Sports  See more Model Name: EVOLT E-420 Brand: Olympus Model Number: 262082 Age Range (Description): Kid Processor Description: TruePic III Item Dimensions LxWxH: 5.12 x 2.09 x 3.58 inches Item Weight: 0.94 Pounds",
            "price": null,
            "rating": 3.6,
            "categories": [
                "Electronics",
                "Camera & Photo",
                "Digital Cameras",
                "DSLR Cameras"
            ]
        },
        "domain": "digital_camera"
    },
    {
        "story": "You make short videos and photos for a cooking blog and a small YouTube channel. You film at a kitchen counter, a desk, and outside at a market. You want a camera that starts fast, finds faces and eyes, and lets you flip the screen forward when you record yourself. You shoot 4K clips for simple edits and want handheld footage to look steady without a gimbal. Touch focus should be quick so you can tap from a bowl to a knife and back. In bright light you still want a clear view through an electronic finder. Indoors, you need clean results at higher ISO so food doesn’t turn muddy. Bursts should handle quick moments like a steam puff or a pan flip. You often send a few stills to your phone right away for posts, so easy wireless transfer is important. Controls should be simple, with a touchscreen for settings you hit a lot. The kit zoom should cover close-ups on the counter and wider views of the whole setup.",
        "img_path": "https://m.media-amazon.com/images/I/5121MnGNTdL._AC_.jpg",
        "target": {
            "title": "Canon EOS M50 24.1MP Mirrorless Digital Camera (Black) + EF-M 15-45mm f/3.5-6.3 is STM Lens (Graphite) + 48GB Memory + Filters & Macros + Spider Tripod + Slave Flash + Professional Accessory Kit",
            "asin": "B07D7H3ZPP",
            "content": "title: Canon EOS M50 24.1MP Mirrorless Digital Camera (Black) + EF-M 15-45mm f/3.5-6.3 is STM Lens (Graphite) + 48GB Memory + Filters & Macros + Spider Tripod + Slave Flash + Professional Accessory Kit  features: This Canon EOS M50 Camera Bundle Kit comes complete with all manufacturer supplied accessories and includes: Canon EOS M50 Mirrorless Digital Camera - 24.1MP APS-C CMOS Sensor - DIGIC 8 Image Processor - 2.36m-Dot OLED Electronic Viewfinder - 3.0\" 1.04m-Dot Vari-Angle Touchscreen - UHD 4K and HD 720p120 Video Recording - Built-In Wi-Fi with NFC, Bluetooth - Dual Pixel CMOS AF - Extended ISO 51200, 10 fps Shooting - Combination 5-Axis Image Stabilization Canon EF-M 15-45mm f/3.5-6.3 IS STM Lens - EF-M Mount lens which offers a 24-72mm equivalent focal length range when used with APS-C-format EOS M-series mirrorless cameras. The lens placement has been optimized, and coatings have been applied, to reduce flare and ghosting for increased contrast and clarity when photographing in difficult lighting conditions. Premium Accessories including high speed memory, 3 Piece Filter kit, 4 Pcs Macro Close-Up Kit In addition the bundle includes Spider flexible tripod, 2 lens hoods, flash light, Soft padded camera case, Canon original battery, Canon original battery charger, Canon camera strap, Body & lens caps..  description: Comprising a versatile feature-set to suit both stills and video applications, the EOS M50 Mirrorless Digital Camera from Canon separates itself from the pack with UHD 4K video recording, a high-resolution electronic viewfinder, and improved Dual Pixel CMOS AF with Eye Detection AF. The sensor and processor combination also enables UHD 4K video recording at 23.98 fps. Camera Features:- 24.1MP APS-C CMOS Sensor 24.1MP APS-C CMOS Sensor 3.0\" 1.04m-Dot Vari-Angle Touchscreen 3.0\" 1.04m-Dot Vari-Angle Touchscreen UHD 4K and HD 720p120 Video Recording UHD 4K and HD 720p120 Video Recording Built-In Wi-Fi with NFC, Bluetooth Built-In Wi-Fi with NFC, Bluetooth Extended ISO 51200, 10 fps Shooting Extended ISO 51200, 10 fps Shooting This Canon Mirrorless Camera bundles includes:- Canon EOS M50 Mirrorless Digital Camera Canon EOS M50 Mirrorless Digital Camera Canon EF-M 15-45mm f/3.5-6.3 IS STM Lens (Graphite) Canon EF-M 15-45mm f/3.5-6.3 IS STM Lens (Graphite) Canon Lithium Battery Canon Lithium Battery Canon Battery Charger Canon Battery Charger Canon Neck Strap Canon Neck Strap Canon Body & Lens Caps Canon Body & Lens Caps 1x 16GB High Speed Memory Card 1x 16GB High Speed Memory Card 1x 32GB High Speed Memory Card 1x 32GB High Speed Memory Card Deluxe Soft Padder Camera Bag Deluxe Soft Padder Camera Bag Spider Flexible Tripod Spider Flexible Tripod 1x Tulip Sunshade Hood 1x Tulip Sunshade Hood 1x Rubber Hood 1x Rubber Hood Electronic Slave Flash Electronic Slave Flash 3PC Filter Kit (1x UV, 1X FLD, 1X CPL) 3PC Filter Kit (1x UV, 1X FLD, 1X CPL) 4PC Macro Close Up Kit (+1, +2, +4, +10) 4PC Macro Close Up Kit (+1, +2, +4, +10) High Speed Memory Card Reader High Speed Memory Card Reader Lens Keeper Lens Keeper Lens Pen & Dust Blower Lens Pen & Dust Blower 5 Piece Starter Kit 5 Piece Starter Kit  details: Auto Focus Technology: Contrast Detection Photo Sensor Size: APS-C Effective Still Resolution: 24.1 MP Camera Flash: Hammerhead Video Capture Format: 4k Video Capture Resolution: FHD 1080p Video Standard: AVCHD Viewfinder Type: Electronic Screen Size: 3 Inches Display Type: OLED Model Name: Eos Brand: Canon Model Number: M50 Color: Black Included Components: Battery Charger, Tripod, Battery, Neck Strap Item Dimensions LxWxH: 4.6 x 3.5 x 2.3 inches Optical Zoom: 3 x Compatible Mountings: Canon EF M Maximum Focal Length: 45 Millimeters Minimum Focal Length: 15 Millimeters Expanded ISO Maximum: 51200 Expanded ISO Minimum: 51200 Batteries Required?: No Are Batteries Included: No Battery Cell Composition: Lithium Target Gender: Unisex Connectivity Technology: Wi-Fi Continuous Shooting Speed: 10 fps Wireless Communication Technology: Wi-Fi Special Feature: Travel Skill Level: Professional Form Factor: Compact Hardware Interface: Bluetooth",
            "price": null,
            "rating": 5.0,
            "categories": [
                "Electronics",
                "Camera & Photo",
                "Digital Cameras",
                "DSLR Cameras"
            ]
        },
        "domain": "digital_camera"
    }
]