[
    {
        "story": "You are looking for a digital camera. You’re helping at a coastal bird sanctuary where sightings can happen either right by the boardwalk or way out across the lagoon. You travel light and don’t want to juggle or swap lenses when a heron lifts off or a wren pops into view. Most of your shooting is handheld, and you frequently frame tall subjects on reeds or tree trunks, so it needs to feel just as steady and comfortable when you’re holding it upright as when you’re shooting horizontally. You often jump from wide habitat context to tight detail on a distant subject in seconds, and setting up a tripod isn’t realistic with wind and passing foot traffic. At the end of each session you like to beam a few clips and photos straight to your phone at the visitors’ center to show the education team that same day. You don’t care about cinematic bells and whistles; clean, dependable footage and reliable reach matter most, along with an all-day carry you can keep ready in your hands rather than in a bag.",
        "img_path": "https://m.media-amazon.com/images/I/91G0RmpalXL._AC_SL1500_.jpg",
        "target": {
            "title": "Samsung WB2200F 16.3MP CMOS Smart WiFi & NFC Digital Camera with 60x Optical Zoom, 3.0in LCD and 1080p HD Video (Black) (Renewed)",
            "asin": "B07FMYZNWS",
            "content": "title: Samsung WB2200F 16.3MP CMOS Smart WiFi & NFC Digital Camera with 60x Optical Zoom, 3.0in LCD and 1080p HD Video (Black) (Renewed)  features: This Certified Refurbished product is tested and certified to look and work like new. The refurbishing process includes functionality testing, basic cleaning, inspection, and repackaging. The product ships with all relevant accessories, a minimum 90-day warranty, and may arrive in a generic box. Only select sellers who maintain a high performance bar may offer Certified Refurbished products on Amazon.com Share your best photos instantly with Family and Friends with Built-in Wi-Fi with NFC SMART features - Social Media Upload, E-mail, Photo beam, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All Share Extended Battery Life - allows over 500 shots per charge 60x Optical Zoom for stunning long distance shots with ease  description: Share your best photos instantly with Family and Friends with Built-in Wi-Fi with NFC SMART features - Social Media Upload, E-mail, Photo beam, Direct Link, Mobile Link, PC Auto-backup, Remote Viewfinder, All Share Extended Battery Life - allows over 500 shots per charge 60x Optical Zoom for stunning long distance shots with ease 3.0 HVGA LCD with EVF  details: Product Dimensions: 4.69 x 4.13 x 4.8 inches Item Weight: 1.56 pounds Item model number: EC-WB2200BPBUS-cr Batteries: 1 Lithium Metal batteries required. Is Discontinued By Manufacturer: No Date First Available: July 17, 2018 Manufacturer: Samsung Brand: SAMSUNG Model Name: WB2200F Maximum Webcam Image Resolution: 16.3 MP Photo Sensor Size: 1/2.3-inch Image Stabilization: Optical, Digital Max Shutter Speed: 1/2000 seconds Min Shutter Speed: 8 seconds Metering Description: Multi, Center-weighted, Spot Exposure Control Type: Program, A/S/M, Smart, Automatic Form Factor: Compact",
            "price": null,
            "rating": 4.0,
            "categories": [
                "Electronics",
                "Camera & Photo",
                "Digital Cameras",
                "DSLR Cameras"
            ]
        },
        "domain": "digital_camera"
    }
]