[
    {
        "story": "You are looking for a laptop. You edit highlight reels and gaming videos for streamers, and you also game a lot yourself. You spend hours rendering clips, recording gameplay, and testing footage before uploading. You need a machine that keeps a steady frame rate while recording and handles large project files without choking. The screen should be large enough for comfortable editing and also great for gaming with rich color and smooth motion. You often connect to TVs or projectors for reviews or casual gaming, so you want a standard HDMI port. You don’t mind a big, heavy chassis if it stays cool and quiet under load. A bright keyboard helps when you work or play late. You keep games and video projects on the same system, so you need both speed and plenty of local storage. Sometimes you burn highlights or finished videos to disc for clients or events. You mostly use it plugged in at home, where consistency and stability matter more than anything.",
        "img_path": "https://m.media-amazon.com/images/I/41Dxdk1IUoL._AC_.jpg",
        "target": {
            "asin": "B01ER4AX8S",
            "content": "title: Acer Predator 17 Gaming Laptop, 17.3” Full HD, Core i7, NVIDIA GTX980M, 16GB DDR4, 512GB SSD, 1TB HDD, Win 10, G9-792-79VJ  features: Intel Core i7-6700HQ Processor 2.6GHz (Up to 3.5GHz) 17.3\" Full HD IPS Screen, NVIDIA GeForce GTX 980M with 8GB GDDR5 VRAM 16GB DDR4 Memory 512GB SSD in RAID 0, 1TB Hard Drive, 6X Blu-Ray Windows 10 Home, Up to 7-hours Battery Life  description: Acer Predator 17 G9-792-79VJ Gaming Notebook comes with these high level specs: 6th Generation Intel Core i7-6700HQ Processor 2.6GHz with Turbo Boost Technology up to 3.5GHz, Windows 10 Home, 17.3\" Full HD (1920 x 1080) widescreen LED-backlit IPS display, NVIDIA GeForce GTX 980M with 8 GB of dedicated GDDR5 VRAM, 16GB DDR4 Memory, 512GB SSD in Raid 0, 1TB SATA Hard Drive (7200RPM), 6X Blu-ray Re-writable Drive, Acer True Harmony Premium High-Performance Sound System, Four Built-in Stereo Speakers and Two Subwoofers, Built-in Digital Microphone, Secure Digital (SD) card reader, Killer Wireless-AC 1535 802.11ac WiFi featuring 2x2 MU-MIMO technology (Dual-Band 2.4GHz and 5GHz), Bluetooth 4.1, Gigabit Ethernet, Built-In HD Webcam, 1 - Thunderbolt 3 (Full USB 3.1 Type C) Port, 4 - USB 3.0 Ports, 1 - HDMI Port, 1 - Display Port, 8-cell Li-ion Battery (6000 mAh), Up to 7-hours Battery Life, 9.26 lbs. | 4.2 kg (system unit only) (NX.Q0PAA.002)  details: Standing screen display size: 17.3 Inches Max Screen Resolution: 1920 x 1080 Pixels Processor: 2.6 GHz core_i7 RAM: 16 GB DDR4 Memory Speed: 2133 MHz Hard Drive: 1 TB SSD Graphics Coprocessor: NVIDIA GeForce GTX 1060 Chipset Brand: NVIDIA Card Description: Dedicated Wireless Type: 802.11ac Number of USB 3.0 Ports: 4 Average Battery Life (in hours): 7 Hours Brand: Acer Series: G9-792 Item model number: G9-792-79VJ Operating System: Windows 10 Item Weight: 9.26 pounds Product Dimensions: 16.65 x 12.66 x 1.56 inches Item Dimensions  LxWxH: 16.65 x 12.66 x 1.56 inches Color: Black Processor Brand: Intel Number of Processors: 1 Computer Memory Type: Unknown Flash Memory Size: 512 Hard Drive Rotational Speed: 7200 RPM Power Source: Battery Powered Batteries: 1 Lithium Ion batteries required. (included) Date First Available: May 6, 2016 Model Name: G9-792 Screen Size: 17.3 Inches Hard Disk Size: 1 TB CPU Model: Core i7 Ram Memory Installed Size: 16 GB Graphics Card Description: Dedicated",
            "title": "Acer Predator 17 Gaming Laptop, 17.3” Full HD, Core i7, NVIDIA GTX980M, 16GB DDR4, 512GB SSD, 1TB HDD, Win 10, G9-792-79VJ",
            "average_rating": 4.1,
            "categories": [
                "Electronics",
                "Computers & Accessories",
                "Computers & Tablets",
                "Laptops",
                "Traditional Laptops"
            ]
        },
        "domain": "Laptop",
        "task_version": "long"
    },
    {
        "story": "You’re looking for a laptop for school. Most of your work lives in the browser: notes, slides, course sites, and shared docs. It should wake quickly and stay smooth with a lot of tabs open. You do not want to fuss with updates before class, you want to open the lid and start working. Calls for group projects and office hours should look and sound clear in busy rooms. Your earbuds should pair quickly, and the connection should hold steady as you move around campus. Local space can be modest for downloads and offline readings since you keep the rest online. It needs to be light enough to carry all day, stay cool on your lap, and slide into a backpack without a fight. Battery should last through a full block of classes and a library session. The keyboard should feel steady for long notes, and the screen should stay easy to read under classroom lights. Plug it in at night, open it in the morning, and it is ready for notes, calls, and submissions.",
        "img_path": "https://m.media-amazon.com/images/I/414ORtp66hS._AC_.jpg",
        "target": {
            "asin": "B094BXZKXZ",
            "content": "title: HP Chromebook 14 Laptop, Intel Celeron N4000 Processor, 4 GB RAM, 32 GB eMMC, 14” HD Display, Chrome, Lightweight Computer with Webcam and Dual Mics, Home, School, Music, Movies, (Renewed)  features: REMOTE WORK READY - Work efficiently from the comfort of your own home office using the HP 14\" Chromebook. CLEAR IMAGING - Images appear crisp with the 14\" HD (1366 x 768), micro-edge, anti-glare (1) display. LIGHTNING FAST PROCESSING - Games, music, and binge watching are taken to new heights with Intel Celeron N4000 (2) processing power and Intel UHD Graphics 600 (3). SECURELY SAVE YOUR WORK - With 32 GB eMMC storage (4), saving important documents is made simple. Plus, quickly access your documents with 4 GB of RAM. LONG-LASTING BATTERY LIFE - Enjoy up to 13 hours and 30 minutes of wireless streaming (5) depending usage. MODERNIZE YOUR WORLD - Navigate seamlessly through tabs and programs with the Chrome operating system. Also, rest easy knowing your investment is protected with HP’s 1-Year Limited Hardware Warranty. BE SEEN & HEARD - HP’s Wide Vision HD camera (6) with integrated dual array digital microphones lets you video chat with vibrant clarity. CONNECT SMOOTHLY - Your connections are rock solid with the Wi-Fi 5 (2x2) and Bluetooth 5.0 combo (7). TAKE WORK WHEREVER YOU GO - The Chromebook is 3.24 lbs (8) so you can take your work and entertainment wherever you need it. ENERGY-EFFICIENT - Do the environment a favor by working with an HP ENERGY STAR certified (9) and EPEAT Silver registered (10) laptop computer.  description: This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.  details: Standing screen display size: 14 Inches Screen Resolution: 1366 x 768 pixels Max Screen Resolution: 1366 x 768 Pixels Processor: 2.6 GHz celeron RAM: 4 GB DDR4 Memory Speed: 2.6 GHz Hard Drive: Emmc Graphics Coprocessor: Intel UHD Graphics 600 Chipset Brand: Intel Card Description: Integrated Wireless Type: Bluetooth Average Battery Life (in hours): 12 Hours Brand: HP Series: HP Chromebook Item model number: HP 14inch Chromebook Hardware Platform: Chromebook Operating System: Chrome OS Item Weight: 3.24 pounds Product Dimensions: 12.82 x 8.6 x 0.7 inches Item Dimensions  LxWxH: 12.82 x 8.6 x 0.7 inches Color: Ceramic White Processor Brand: Intel Number of Processors: 2 Computer Memory Type: DDR4 SDRAM Flash Memory Size: 4 Hard Drive Interface: USB Power Source: Battery Powered Batteries: 1 Lithium Ion batteries required. Best Sellers Rank: {'Computers & Accessories': 34841, 'Climate Pledge Friendly: Computers': 3704, 'Traditional Laptop Computers': 6084} Date First Available: May 7, 2021 Model Name: HP Chromebook Screen Size: 14 Inches Hard Disk Size: 0.01 MB CPU Model: Celeron Ram Memory Installed Size: 4 GB Special Feature: Anti-glare Graphics Card Description: Integrated",
            "title": "HP Chromebook 14 Laptop, Intel Celeron N4000 Processor, 4 GB RAM, 32 GB eMMC, 14” HD Display, Chrome, Lightweight Computer with Webcam and Dual Mics, Home, School, Music, Movies, (Renewed)",
            "average_rating": 4.1,
            "categories": [
                "Electronics",
                "Computers & Accessories",
                "Computers & Tablets",
                "Laptops",
                "Traditional Laptops"
            ]
        },
        "domain": "Laptop",
        "task_version": "long"
    },
    {
        "story": "You meet clients on site and in conference rooms, and you switch between taking notes, sketching ideas, and showing rough drafts on a table. You want a laptop that wakes fast and lets you write directly on the screen with a pen. It should fold into a stand for quick show-and-tell or lay flat when you need to mark up a plan together. Typing should feel steady for long meeting notes, and keys should be easy to see in dim rooms. Signing in should be quick so you can get back to the discussion without typing passwords. You don’t want to carry a bag of adapters; it should handle common drives, displays, and chargers without fuss. Calls with clients need to be clear so you can join from a quiet corner without extra gear. You carry it all day, so it has to be light enough to hold in one arm, but sturdy enough to toss in a bag. At day’s end you review paperwork, sign on the screen, save a clean copy, and send it to the team.",
        "img_path": "https://m.media-amazon.com/images/I/41dd-WmUgOL._AC_.jpg",
        "target": {
            "asin": "B08B643THT",
            "content": "title: Lenovo Flex 5 14\" FHD IPS Touchscreen Premium 2-in-1 Laptop, AMD 4th Gen Ryzen 5 4500U, 16GB RAM, 256GB PCIe SSD, Backlit Keyboard, Fingerprint Reader, Digital Pen Included, Windows 10  features: AMD 4th Generation Ryzen 5 4500U Processor (6-core, 2.3 GHz Up To 4.0 GHz, 8 MB Cache), 16GB DDR4 Memory, 256GB PCIe SSD 14\" Full HD (1920 x 1080) IPS Touchscreen Energy-efficient WLED Display, AMD Radeon Series 802_11_AC, Bluetooth 4.2, Card Reader, HD Audio with Stereo Speakers, Webcam, Fingerprint Reader 1 x USB 3.1 Gen 2 Type-C, 2 x USB 3.1 Type-A, 1 x HDMI, 1 x Headphone/Speaker/Line-Out Jack Backlit Keyboard, Windows 10 Home 64-bit, 52.5WHr 4-cell lithium_ion, 3.63lb, Graphite Grey  details: Standing screen display size: 14 Inches Processor: ryzen_5_4500u RAM: 16 GB Memory Speed: 2.3 GHz Chipset Brand: AMD Card Description: Integrated Wireless Type: Bluetooth Average Battery Life (in hours): 10 Hours Brand: Lenovo Item model number: LENOVO Item Weight: 1.6 Kilograms Product Dimensions: 14.11 x 9.27 x 0.91 inches Item Dimensions  LxWxH: 14.11 x 9.27 x 0.91 inches Rear Webcam Resolution: 1.2 MP Number of Processors: 6 Computer Memory Type: DDR4 SDRAM Flash Memory Size: 256 GB Voltage: 5 Volts Best Sellers Rank: {'Computers & Accessories': 33503, '2': 429} Date First Available: June 15, 2020 Screen Size: 14 Inches CPU Model: Ryzen 5 4500U Ram Memory Installed Size: 16 GB Special Feature: Backlit Keyboard,Fingerprint Reader,Pen,Stereo Speakers Graphics Card Description: Integrated Resolution: 1080p Total USB Ports: 1 Connectivity Technology: Bluetooth, USB, Ethernet, HDMI",
            "title": "Lenovo Flex 5 14\" FHD IPS Touchscreen Premium 2-in-1 Laptop, AMD 4th Gen Ryzen 5 4500U, 16GB RAM, 256GB PCIe SSD, Backlit Keyboard, Fingerprint Reader, Digital Pen Included, Windows 10",
            "average_rating": 4.3,
            "categories": [
                "Electronics",
                "Computers & Accessories",
                "Computers & Tablets",
                "Laptops",
                "Traditional Laptops"
            ]
        },
        "domain": "Laptop",
        "task_version": "long"
    },
    {
        "story": "You are looking for a laptop. You edit game clips and also play on the same machine. You want a big screen, smooth performance while recording, and fast load times. You keep both games and projects locally, and sometimes deliver them on a disc. You often plug into a TV or projector. You don’t mind keeping it plugged in; what matters is that it never slows down.",
        "img_path": "https://m.media-amazon.com/images/I/41Dxdk1IUoL._AC_.jpg",
        "target": {
            "asin": "B01ER4AX8S",
            "content": "title: Acer Predator 17 Gaming Laptop, 17.3” Full HD, Core i7, NVIDIA GTX980M, 16GB DDR4, 512GB SSD, 1TB HDD, Win 10, G9-792-79VJ  features: Intel Core i7-6700HQ Processor 2.6GHz (Up to 3.5GHz) 17.3\" Full HD IPS Screen, NVIDIA GeForce GTX 980M with 8GB GDDR5 VRAM 16GB DDR4 Memory 512GB SSD in RAID 0, 1TB Hard Drive, 6X Blu-Ray Windows 10 Home, Up to 7-hours Battery Life  description: Acer Predator 17 G9-792-79VJ Gaming Notebook comes with these high level specs: 6th Generation Intel Core i7-6700HQ Processor 2.6GHz with Turbo Boost Technology up to 3.5GHz, Windows 10 Home, 17.3\" Full HD (1920 x 1080) widescreen LED-backlit IPS display, NVIDIA GeForce GTX 980M with 8 GB of dedicated GDDR5 VRAM, 16GB DDR4 Memory, 512GB SSD in Raid 0, 1TB SATA Hard Drive (7200RPM), 6X Blu-ray Re-writable Drive, Acer True Harmony Premium High-Performance Sound System, Four Built-in Stereo Speakers and Two Subwoofers, Built-in Digital Microphone, Secure Digital (SD) card reader, Killer Wireless-AC 1535 802.11ac WiFi featuring 2x2 MU-MIMO technology (Dual-Band 2.4GHz and 5GHz), Bluetooth 4.1, Gigabit Ethernet, Built-In HD Webcam, 1 - Thunderbolt 3 (Full USB 3.1 Type C) Port, 4 - USB 3.0 Ports, 1 - HDMI Port, 1 - Display Port, 8-cell Li-ion Battery (6000 mAh), Up to 7-hours Battery Life, 9.26 lbs. | 4.2 kg (system unit only) (NX.Q0PAA.002)  details: Standing screen display size: 17.3 Inches Max Screen Resolution: 1920 x 1080 Pixels Processor: 2.6 GHz core_i7 RAM: 16 GB DDR4 Memory Speed: 2133 MHz Hard Drive: 1 TB SSD Graphics Coprocessor: NVIDIA GeForce GTX 1060 Chipset Brand: NVIDIA Card Description: Dedicated Wireless Type: 802.11ac Number of USB 3.0 Ports: 4 Average Battery Life (in hours): 7 Hours Brand: Acer Series: G9-792 Item model number: G9-792-79VJ Operating System: Windows 10 Item Weight: 9.26 pounds Product Dimensions: 16.65 x 12.66 x 1.56 inches Item Dimensions  LxWxH: 16.65 x 12.66 x 1.56 inches Color: Black Processor Brand: Intel Number of Processors: 1 Computer Memory Type: Unknown Flash Memory Size: 512 Hard Drive Rotational Speed: 7200 RPM Power Source: Battery Powered Batteries: 1 Lithium Ion batteries required. (included) Date First Available: May 6, 2016 Model Name: G9-792 Screen Size: 17.3 Inches Hard Disk Size: 1 TB CPU Model: Core i7 Ram Memory Installed Size: 16 GB Graphics Card Description: Dedicated",
            "title": "Acer Predator 17 Gaming Laptop, 17.3” Full HD, Core i7, NVIDIA GTX980M, 16GB DDR4, 512GB SSD, 1TB HDD, Win 10, G9-792-79VJ",
            "average_rating": 4.1,
            "categories": [
                "Electronics",
                "Computers & Accessories",
                "Computers & Tablets",
                "Laptops",
                "Traditional Laptops"
            ]
        },
        "domain": "Laptop",
        "task_version": "short"
    },
    {
        "story": "You’re looking for a laptop for school. Most of your work is in the browser: notes, slides, course sites, and shared docs. It should start fast and stay smooth with many tabs open. You don’t want to mess with updates before class — open the lid and go. Calls for group projects and office hours should look and sound clear in busy rooms. Earbuds should pair quickly and stay connected around campus. Local space can be modest since you keep most files online. It should be light, cool on your lap, and easy to carry all day. Ready each morning for notes, calls, and submissions.",
        "img_path": "https://m.media-amazon.com/images/I/414ORtp66hS._AC_.jpg",
        "target": {
            "asin": "B094BXZKXZ",
            "content": "title: HP Chromebook 14 Laptop, Intel Celeron N4000 Processor, 4 GB RAM, 32 GB eMMC, 14” HD Display, Chrome, Lightweight Computer with Webcam and Dual Mics, Home, School, Music, Movies, (Renewed)  features: REMOTE WORK READY - Work efficiently from the comfort of your own home office using the HP 14\" Chromebook. CLEAR IMAGING - Images appear crisp with the 14\" HD (1366 x 768), micro-edge, anti-glare (1) display. LIGHTNING FAST PROCESSING - Games, music, and binge watching are taken to new heights with Intel Celeron N4000 (2) processing power and Intel UHD Graphics 600 (3). SECURELY SAVE YOUR WORK - With 32 GB eMMC storage (4), saving important documents is made simple. Plus, quickly access your documents with 4 GB of RAM. LONG-LASTING BATTERY LIFE - Enjoy up to 13 hours and 30 minutes of wireless streaming (5) depending usage. MODERNIZE YOUR WORLD - Navigate seamlessly through tabs and programs with the Chrome operating system. Also, rest easy knowing your investment is protected with HP’s 1-Year Limited Hardware Warranty. BE SEEN & HEARD - HP’s Wide Vision HD camera (6) with integrated dual array digital microphones lets you video chat with vibrant clarity. CONNECT SMOOTHLY - Your connections are rock solid with the Wi-Fi 5 (2x2) and Bluetooth 5.0 combo (7). TAKE WORK WHEREVER YOU GO - The Chromebook is 3.24 lbs (8) so you can take your work and entertainment wherever you need it. ENERGY-EFFICIENT - Do the environment a favor by working with an HP ENERGY STAR certified (9) and EPEAT Silver registered (10) laptop computer.  description: This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.  details: Standing screen display size: 14 Inches Screen Resolution: 1366 x 768 pixels Max Screen Resolution: 1366 x 768 Pixels Processor: 2.6 GHz celeron RAM: 4 GB DDR4 Memory Speed: 2.6 GHz Hard Drive: Emmc Graphics Coprocessor: Intel UHD Graphics 600 Chipset Brand: Intel Card Description: Integrated Wireless Type: Bluetooth Average Battery Life (in hours): 12 Hours Brand: HP Series: HP Chromebook Item model number: HP 14inch Chromebook Hardware Platform: Chromebook Operating System: Chrome OS Item Weight: 3.24 pounds Product Dimensions: 12.82 x 8.6 x 0.7 inches Item Dimensions  LxWxH: 12.82 x 8.6 x 0.7 inches Color: Ceramic White Processor Brand: Intel Number of Processors: 2 Computer Memory Type: DDR4 SDRAM Flash Memory Size: 4 Hard Drive Interface: USB Power Source: Battery Powered Batteries: 1 Lithium Ion batteries required. Best Sellers Rank: {'Computers & Accessories': 34841, 'Climate Pledge Friendly: Computers': 3704, 'Traditional Laptop Computers': 6084} Date First Available: May 7, 2021 Model Name: HP Chromebook Screen Size: 14 Inches Hard Disk Size: 0.01 MB CPU Model: Celeron Ram Memory Installed Size: 4 GB Special Feature: Anti-glare Graphics Card Description: Integrated",
            "title": "HP Chromebook 14 Laptop, Intel Celeron N4000 Processor, 4 GB RAM, 32 GB eMMC, 14” HD Display, Chrome, Lightweight Computer with Webcam and Dual Mics, Home, School, Music, Movies, (Renewed)",
            "average_rating": 4.1,
            "categories": [
                "Electronics",
                "Computers & Accessories",
                "Computers & Tablets",
                "Laptops",
                "Traditional Laptops"
            ]
        },
        "domain": "Laptop",
        "task_version": "short"
    },
    {
        "story": "You meet clients all day and need a laptop that fits meetings. It should wake fast and let you write on the screen with a pen. You want it to fold into a stand for quick demos and lay flat to mark up plans. The keyboard should be easy to read in dim rooms, and sign-in should be one touch so you don’t lose the room. You don’t want adapters — it should handle common drives, displays, and chargers. Video calls must be clear without extra setup. Light, sturdy, and easy to carry between rooms, then ready to sign and send files at night.",
        "img_path": "https://m.media-amazon.com/images/I/41dd-WmUgOL._AC_.jpg",
        "target": {
            "asin": "B08B643THT",
            "content": "title: Lenovo Flex 5 14\" FHD IPS Touchscreen Premium 2-in-1 Laptop, AMD 4th Gen Ryzen 5 4500U, 16GB RAM, 256GB PCIe SSD, Backlit Keyboard, Fingerprint Reader, Digital Pen Included, Windows 10  features: AMD 4th Generation Ryzen 5 4500U Processor (6-core, 2.3 GHz Up To 4.0 GHz, 8 MB Cache), 16GB DDR4 Memory, 256GB PCIe SSD 14\" Full HD (1920 x 1080) IPS Touchscreen Energy-efficient WLED Display, AMD Radeon Series 802_11_AC, Bluetooth 4.2, Card Reader, HD Audio with Stereo Speakers, Webcam, Fingerprint Reader 1 x USB 3.1 Gen 2 Type-C, 2 x USB 3.1 Type-A, 1 x HDMI, 1 x Headphone/Speaker/Line-Out Jack Backlit Keyboard, Windows 10 Home 64-bit, 52.5WHr 4-cell lithium_ion, 3.63lb, Graphite Grey  details: Standing screen display size: 14 Inches Processor: ryzen_5_4500u RAM: 16 GB Memory Speed: 2.3 GHz Chipset Brand: AMD Card Description: Integrated Wireless Type: Bluetooth Average Battery Life (in hours): 10 Hours Brand: Lenovo Item model number: LENOVO Item Weight: 1.6 Kilograms Product Dimensions: 14.11 x 9.27 x 0.91 inches Item Dimensions  LxWxH: 14.11 x 9.27 x 0.91 inches Rear Webcam Resolution: 1.2 MP Number of Processors: 6 Computer Memory Type: DDR4 SDRAM Flash Memory Size: 256 GB Voltage: 5 Volts Best Sellers Rank: {'Computers & Accessories': 33503, '2': 429} Date First Available: June 15, 2020 Screen Size: 14 Inches CPU Model: Ryzen 5 4500U Ram Memory Installed Size: 16 GB Special Feature: Backlit Keyboard,Fingerprint Reader,Pen,Stereo Speakers Graphics Card Description: Integrated Resolution: 1080p Total USB Ports: 1 Connectivity Technology: Bluetooth, USB, Ethernet, HDMI",
            "title": "Lenovo Flex 5 14\" FHD IPS Touchscreen Premium 2-in-1 Laptop, AMD 4th Gen Ryzen 5 4500U, 16GB RAM, 256GB PCIe SSD, Backlit Keyboard, Fingerprint Reader, Digital Pen Included, Windows 10",
            "average_rating": 4.3,
            "categories": [
                "Electronics",
                "Computers & Accessories",
                "Computers & Tablets",
                "Laptops",
                "Traditional Laptops"
            ]
        },
        "domain": "Laptop",
        "task_version": "short"
    }
]