[
    {
        "story": "You are looking for a laptop. You edit game clips and also play on the same machine. You want a big screen, smooth performance while recording, and fast load times. You keep both games and projects locally, and sometimes hand clients a disc. You often plug into a TV or projector. Battery life isn’t a priority; steady performance is.",
        "img_path": "https://m.media-amazon.com/images/I/41Dxdk1IUoL._AC_.jpg",
        "target": {
            "asin": "B01ER4AX8S",
            "content": "title: Acer Predator 17 Gaming Laptop, 17.3” Full HD, Core i7, NVIDIA GTX980M, 16GB DDR4, 512GB SSD, 1TB HDD, Win 10, G9-792-79VJ  features: Intel Core i7-6700HQ Processor 2.6GHz (Up to 3.5GHz) 17.3\" Full HD IPS Screen, NVIDIA GeForce GTX 980M with 8GB GDDR5 VRAM 16GB DDR4 Memory 512GB SSD in RAID 0, 1TB Hard Drive, 6X Blu-Ray Windows 10 Home, Up to 7-hours Battery Life  description: Acer Predator 17 G9-792-79VJ Gaming Notebook comes with these high level specs: 6th Generation Intel Core i7-6700HQ Processor 2.6GHz with Turbo Boost Technology up to 3.5GHz, Windows 10 Home, 17.3\" Full HD (1920 x 1080) widescreen LED-backlit IPS display, NVIDIA GeForce GTX 980M with 8 GB of dedicated GDDR5 VRAM, 16GB DDR4 Memory, 512GB SSD in Raid 0, 1TB SATA Hard Drive (7200RPM), 6X Blu-ray Re-writable Drive, Acer True Harmony Premium High-Performance Sound System, Four Built-in Stereo Speakers and Two Subwoofers, Built-in Digital Microphone, Secure Digital (SD) card reader, Killer Wireless-AC 1535 802.11ac WiFi featuring 2x2 MU-MIMO technology (Dual-Band 2.4GHz and 5GHz), Bluetooth 4.1, Gigabit Ethernet, Built-In HD Webcam, 1 - Thunderbolt 3 (Full USB 3.1 Type C) Port, 4 - USB 3.0 Ports, 1 - HDMI Port, 1 - Display Port, 8-cell Li-ion Battery (6000 mAh), Up to 7-hours Battery Life, 9.26 lbs. | 4.2 kg (system unit only) (NX.Q0PAA.002)  details: Standing screen display size: 17.3 Inches Max Screen Resolution: 1920 x 1080 Pixels Processor: 2.6 GHz core_i7 RAM: 16 GB DDR4 Memory Speed: 2133 MHz Hard Drive: 1 TB SSD Graphics Coprocessor: NVIDIA GeForce GTX 1060 Chipset Brand: NVIDIA Card Description: Dedicated Wireless Type: 802.11ac Number of USB 3.0 Ports: 4 Average Battery Life (in hours): 7 Hours Brand: Acer Series: G9-792 Item model number: G9-792-79VJ Operating System: Windows 10 Item Weight: 9.26 pounds Product Dimensions: 16.65 x 12.66 x 1.56 inches Item Dimensions  LxWxH: 16.65 x 12.66 x 1.56 inches Color: Black Processor Brand: Intel Number of Processors: 1 Computer Memory Type: Unknown Flash Memory Size: 512 Hard Drive Rotational Speed: 7200 RPM Power Source: Battery Powered Batteries: 1 Lithium Ion batteries required. (included) Date First Available: May 6, 2016 Model Name: G9-792 Screen Size: 17.3 Inches Hard Disk Size: 1 TB CPU Model: Core i7 Ram Memory Installed Size: 16 GB Graphics Card Description: Dedicated",
            "title": "Acer Predator 17 Gaming Laptop, 17.3” Full HD, Core i7, NVIDIA GTX980M, 16GB DDR4, 512GB SSD, 1TB HDD, Win 10, G9-792-79VJ",
            "average_rating": 4.1,
            "categories": [
                "Electronics",
                "Computers & Accessories",
                "Computers & Tablets",
                "Laptops",
                "Traditional Laptops"
            ]
        },
        "domain": "Laptop"
    }
]