[
    {
        "story": "You are looking for running shoes. You run after work on neighborhood streets and the local path, usually five to eight miles, with a longer run here and there. You want a road shoe that’s soft on your knees and calves so back-to-back days don’t beat you up. It should feel smooth and steady at an easy pace, not stiff or twitchy, and stay light enough that you forget about it once you settle in. A breathable upper helps when the weather warms up. Durability matters too, and you expect it to hold up for regular weekly mileage without falling apart.",
        "img_path": "https://m.media-amazon.com/images/I/61kevI2KguL._AC_UL1200_.jpg",
        "target": {
            "asin": "B00R8NUXKO",
            "content": "title: HOKA ONE ONE Men's Clifton 2 Running Shoes  features: Rubber sole  description: HOKA One One Men's Clifton 2 running shoes feature an synthetic and mesh upper. Lightweight No Sew SpeedFrame Construction for comfort. HOKA Race Lace provides a secure and lightweight alternative to regular laces with the added benefit of decreased water retention. Lightly padded tongue provides increased protection across the foot. Structural overlays improve mid-foot support. Early Stage Meta-Rocker midsole supports a runners form and encourages a continuous Positive Gait Speed roll from heel-strike to toe-off. A Full Length HIP CMEVA midsole which is up to 2.5X the volume than standard running shoes provides signature cushioning and excellent shock absorption and an inherently stable ride. 4mm Heel to Toe Offset; Full Ground Contact Design. Strategic Hi-Abrasion Rubber Zoned outsole for durable traction withes strategically placed rubber pods to improve durability.  details: Is Discontinued By Manufacturer: No Item model number: 1008328-TBOF Department: mens Date First Available: June 8, 2015 Manufacturer: HOKA ONE ONE",
            "title": "HOKA ONE ONE Men's Clifton 2 Running Shoes",
            "average_rating": 4.4,
            "categories": [
                "Clothing, Shoes & Jewelry",
                "Men",
                "Shoes",
                "Athletic",
                "Running",
                "Road Running"
            ]
        },
        "domain": "Running Shoes"
    }
]