[
    {
        "story": "You are looking for running shoes. You’ve been running for a while but mostly to stay in shape and clear your head after work. Your usual route is a mix of neighborhood streets, bike paths, and the occasional park loop when you want some variety. Most of your runs are five to eight miles, but now and then you stretch it to ten on the weekend. You’re not chasing race times; you just want something that feels easy on your knees and calves, especially on back-to-back days. You prefer a shoe that feels stable and soft when you land, not something stiff or aggressive. You’ve tried minimalist shoes before and they left your legs sore. You’d like something that still feels light enough to keep a smooth rhythm but gives enough cushion that you can forget about your feet halfway through the run. You usually head out early or late when the pavement is cool, so a breathable upper helps, and you want the build to last more than a few hundred miles without breaking down.",
        "img_path": "https://m.media-amazon.com/images/I/61kevI2KguL._AC_UL1200_.jpg",
        "target": {
            "asin": "B00R8NUXKO",
            "content": "title: HOKA ONE ONE Men's Clifton 2 Running Shoes  features: Rubber sole  description: HOKA One One Men's Clifton 2 running shoes feature an synthetic and mesh upper. Lightweight No Sew SpeedFrame Construction for comfort. HOKA Race Lace provides a secure and lightweight alternative to regular laces with the added benefit of decreased water retention. Lightly padded tongue provides increased protection across the foot. Structural overlays improve mid-foot support. Early Stage Meta-Rocker midsole supports a runners form and encourages a continuous Positive Gait Speed roll from heel-strike to toe-off. A Full Length HIP CMEVA midsole which is up to 2.5X the volume than standard running shoes provides signature cushioning and excellent shock absorption and an inherently stable ride. 4mm Heel to Toe Offset; Full Ground Contact Design. Strategic Hi-Abrasion Rubber Zoned outsole for durable traction withes strategically placed rubber pods to improve durability.  details: Is Discontinued By Manufacturer: No Item model number: 1008328-TBOF Department: mens Date First Available: June 8, 2015 Manufacturer: HOKA ONE ONE",
            "title": "HOKA ONE ONE Men's Clifton 2 Running Shoes",
            "average_rating": 4.4,
            "categories": [
                "Clothing, Shoes & Jewelry",
                "Men",
                "Shoes",
                "Athletic",
                "Running",
                "Road Running"
            ]
        },
        "domain": "Runnning Shoes"
    }
]